Repository: Xapocc/training_application
Catalog: lib/l10n/app_*.arb
Languages: ru

# longErrorMessage
source: some long error text with a lot of symbols and words for testing your error screen as it should display every error`s message despite how long it is
ru: просто длинное сообщение об ошибке с большим количеством символов для тестирования вашего экрана с ошибкой так как он должен отображать любое сообщение об ошибке, вне зависимости от его длины

# dataTask3Screen
source: data
ru: данные

# button0ChooseScreen
source: Task 3 Screen
ru: Экран 3-й задачи

# button1ChooseScreen
source: Task 4 Screen
ru: Экран 4-й задачи

# button2ChooseScreen
source: Gps Tracker Screen
ru: Экран GPS трекера

# textButtonStartTimerTask4Screen
source: Start
ru: Старт

# stateCountersTextTask4Screen1
source: {isData,plural, =1{Data} other{Error}}
ru: {isData,plural, =1{данными} other{ошибкой}}

# stateCountersTextTask4Screen2
source: {count,plural, =1{{isData} state appeared {count} time} other{{isData} state appeared {count} times}}
ru: {count,plural, =1{Состояние с {isData} появлялось {count} раз} =2{Состояние с {isData} появлялось {count} раза} few{Состояние с {isData} появлялось {count} раза} other{Состояние с {isData} появлялось {count} раз}}

# stateLastDateTextTask4Screen1
source: Last {isDataState} state appearance date is {date}
ru: Последнее появление состояния с {isDataState} было {date}

# stateLastDateTextTask4Screen2
source: {isData,plural, =1{data} other{error}}
ru: {isData,plural, =1{данными} other{ошибкой}}

# spinnerTextStatisticScreen
source: Please wait {time,plural, =1{{time} second} other{{time} seconds}
ru: Пожалуйста, подождите {time,plural, =1{{time} секунду} =2{{time} секунды} =few{{time} секунды} other{{time} секунд}

# stateCountersTextStatisticScreen1
source: {count,plural, =1{{isData} state appeared {count} time now} other{{isData} state appeared {count} times now}}
ru: {count,plural, =1{Состояние c {isData} появлялось уже {count} раз} =2{Состояние c {isData} появлялось уже {count} раза} few{Состояние c {isData} появлялось уже {count} раза} other{Состояние c {isData} появлялось уже {count} раз}}

# stateCountersTextStatisticScreen2
source: {isData,plural, =1{Data} other{Error}}
ru: {isData,plural, =1{данными} other{ошибкой}}

# stateLastDateTextStatisticScreen
source: Last appearance date is {date}
ru: Дата последнего появления: {date}

# nextButtonPauseStateGpsTrackerScreen
source: Show Path
ru: Показать путь

# backButtonPauseStateGpsTrackerScreen
source: Start Again
ru: Начать заново

# trackingTrackingIndicatorGpsTrackerScreen
source: Tracking...
ru: Отслеживание...

# counterTrackingIndicatorGpsTrackerScreen
source: GPS points saved: {count}
ru: GPS точек сохранено: {count}

# buttonTrackingStateGpsTrackerScreen
source: {isTracking,plural, =1{START TRACKING} other{STOP TRACKING}}
ru: {isTracking,plural, =1{НАЧАТЬ ОТСЛЕЖИВАНИЕ} other{ПРЕКРАТИТЬ ОТСЛЕЖИВАНИЕ}}

# messageDataIsMissingGpsPathMapScreen
source: Locations data is missing
ru: Данные о местоположениях отсутствуют
